gpu_chemistry/cases/shearLayer/gri/constant/chemistryProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  owngpu
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    location        "constant";
    object          chemistryProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

chemistry       on;

initialChemicalTimeStep 1;

chemistryType
{
    solver          ode;
}

odeCoeffs
{
    solver          Rosenbrock34;
    absTol          1e-08;
    relTol          0.1;
}

#include        "reactionsGri"


// ************************************************************************* //
